Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Constructor (Point, Vector, Vector)
 Instantiates a plane defined by the given origin, X-axis vector and Y-axis vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometricPlane(
	Point Origin,
	Vector Xaxis,
	Vector Yaxis
)
Public Sub New (
	Origin As Point,
	Xaxis As Vector,
	Yaxis As Vector
)
Parameters
Origin
Type: Tekla.Structures.Geometry3d.Point
The origin to be used.
Xaxis
Type: Tekla.Structures.Geometry3d.Vector
The X-axis to be used.
Yaxis
Type: Tekla.Structures.Geometry3d.Vector
The Y-axis to be used.
See Also
Reference
GeometricPlane Class
GeometricPlane Overload
Tekla.Structures.Geometry3d Namespace